#+AUTHOR: BuddhiLW
#+STARTUP: latexpreview
#+LATEX_HEADER: \usepackage{amsmath, physics}
#+PROPERTY: header-args:clojure :tangle ./src/csv_ledger/core.clj :mkdirp yes

** Preparring CSV (Opening/Closing)
#+begin_src clojure :tangle ./src/csv_ledger/core.clj :mkdirp yes
  (ns csv-ledger.core
    (:require [clojure.data.csv :as csv]
              [clojure.java.io :as io])
    (:gen-class))
  
  (defn -main
    "Call on <<Faturamento.csv>> and <<VALORES_VIORC.csv>>;
    Return \"ledger.csv\", which informs the situation of the balance."
    [spenditure-table raw-table]
    (println "Hello, World!"))
  
  (def opened-revenue (csv/read-csv (io/reader "data/Faturamento.csv")))
  (def header-revenue (first opened-revenue))
  (def raw-revenue (drop 1 opened-revenue))
  
  ;; The lazy way
  (defn read-column [filename column-index]
    (with-open [reader (io/reader filename)]
      (let [data (csv/read-csv reader)]
        (map #(nth % column-index) data))))
  
#+end_src

#+RESULTS:
| #'csv-ledger.core/-main             |
| #'csv-ledger.core/raw-revenue       |
| #'csv-ledger.core/read-column       |
| #'csv-ledger.core/sum-second-column |

*** Example - Sum fixed collon
#+begin_src clojure
  (defn sum-second-column [filename]
    (->> (read-column filename 1)
         (drop 1) ;; Drop header column
         (map #(Double/parseDouble %))
         (reduce + 0)))
#+end_src

#+begin_src clojure :tangle no
(sum-second-column "data/Faturamento.csv")
#+end_src

#+RESULTS:
: class java.io.IOException

*** Transform raw-data into map
Index values with dictionaries (taken from https://github.com/clojure/data.csv/)

*NOTE*: This transform is meant to be done on the =opened-revenue= symbol.

#+begin_src clojure
(defn csv-data->maps [csv-data]
  (map zipmap
       (->> (first csv-data) ;; First row is the header
            (map keyword) ;; Drop if you want string keys instead
            repeat)
	  (rest csv-data)))
#+end_src

#+RESULTS:
: #'csv-ledger.core/csv-data->maps

*** Separate the unique-values of CNPJ
Take the unique values (e.g., create a set)
#+begin_src clojure
(def unique-CNPJ (set (map :CNPJ (csv-data->maps opened-revenue))))
#+end_src

#+RESULTS:
: #'csv-ledger.core/unique-CNPJ
**** Consolidate the process with a Function
Creating a function which take a =CNPJ-value= and filter the list for us

#+begin_src clojure
  (defn cnpj#
    "take a =CNPJ-value= and narrow down to the subclass which has this CNPJ"
    [CNPJ-value vec-revenues]
    (filter #(submap? {:CNPJ CNPJ-value} %) vec-revenues))
#+end_src

#+RESULTS:
: #'csv-ledger.core/cnpj#

***** Example
#+begin_src clojure
  (cnpj# "17194123000103" vec-revenues)
  ;; ({:CNPJ "17194123000103", :FATURAMENTO "1247", : "468626"}) 
#+end_src

#+RESULTS:
| :CNPJ | 17194123000103 | :FATURAMENTO | 1247 | : | 468626 |

| :CNPJ | 17194123000103 | :FATURAMENTO | 1247 | : | 468626 |

*** Defining BIORC dataset,
#+begin_src clojure
  (def opened-biorc (csv/read-csv (io/reader "data/VALORES_BIORC.csv")))
  (def vec-biorc (vec (csv-data->maps opened-biorc)))
#+end_src

#+RESULTS:
| #'csv-ledger.core/opened-biorc |
| #'csv-ledger.core/vec-biorc    |

*** Generalize cnpj#
#+begin_src clojure
  (defn submap-cond#
    "take a =CNPJ-value= and narrow down to the subclass which has this CNPJ"
    [key value vec-revenues]
    (filter #(submap? {(keyword key) value} %) vec-revenues))
#+end_src

#+RESULTS:
: #'csv-ledger.core/submap-cond#

**** Paticularize to CPFCNPJCLI
#+begin_src clojure
  (defn cpf-cnpj#
    [value vec-revenues]
      (submap-cond# "CPFCNPJCLI" value vec-revenues))
#+end_src

#+RESULTS:
: #'csv-ledger.core/cpf-cnpj#

*** Differences in performance
Looking for a key on a map is O(1) and in a vector O(n).
https://www.infoq.com/articles/in-depth-look-clojure-collections/

#+begin_src clojure :tangle no
(defn raw [n] (map keyword (map str (map char (range 97 (+ 97 n))))))
(defn mk-lin [n] (interleave (raw n) (range n)))
(defn mk-map [n] (apply hash-map (mk-lin n)))

(defn lhas [k s] (some #{k} s))
(defn mhas [k s] (s k))

(defn churn [lookup maker n]
  (let [ks (raw n)
         elems (maker n)]
   (dotimes [i 100000]
     (doseq [k ks] (lookup k elems)))))


(time (churn lhas mk-lin 5))
; "Elapsed time: 998.997 msecs"


(time (churn mhas mk-map 5))
; "Elapsed time: 133.133 msecs"
#+end_src

#+RESULTS:
| #'csv-ledger.core/raw    |
| #'csv-ledger.core/mk-lin |
| #'csv-ledger.core/mk-map |
| #'csv-ledger.core/lhas   |
| #'csv-ledger.core/mhas   |
| #'csv-ledger.core/churn  |

**** Define a symbol
=nu-value=: non-unique value
#+begin_src clojure
(def nu-value (cpf-cnpj# (nth (vec unique-CNPJ) 6) vec-biorc))
#+end_src

#+RESULTS:
: #'csv-ledger.core/nu-value

*** Add the values of this key

#+begin_src clojure
  (defn sum-a-numeric-key
    [key coll]
    (reduce + (map bigdec (map (keyword key) coll))))  
#+end_src

#+RESULTS:
: #'csv-ledger.core/sum-a-numeric-key

**** Revenue Symbol
Let's  create a /symbol/ for the =non-unique-value=, nu-value, for revenues also.

#+begin_src clojure :tangle no
(def nu-value-revenue (cnpj# (nth (vec unique-CNPJ) 6) vec-revenues))
#+end_src

#+RESULTS:
: #'csv-ledger.core/nu-value-revenue

Take a look on what it looks like,

#+begin_src clojure :tangle no 
nu-value-revenue
#+end_src

*RESULTS:*
| :CNPJ | 17946892000110 | :FATURAMENTO | 2633 | : | 741867 |

These are the revenue-data for the CNPJ 17946892000110.

Now, selecting only the "FATURAMENTO" value.

#+begin_src clojure :tangle no
((keyword "FATURAMENTO") (first nu-value-revenue))
#+end_src

#+RESULTS:
: 2633

**** Making the math

Answering the age-old question: does he have what it takes? 

#+begin_src clojure :tangle no
  (- (+ (bigdec ((keyword "FATURAMENTO") (first nu-value-revenue)))
        (sum-a-numeric-key "TOTAL_RECEBIDO" nu-value))
     (sum-a-numeric-key "A_RECEBER" nu-value)) 
#+end_src

#+RESULTS:
: 1555.00M

The number resulting number has a positive value. Thus, his [[https://www.investopedia.com/ask/answers/011315/what-difference-between-cash-flow-and-revenue.asp][Cash-flow]] is positive. We can pay all bills, in whichever order we wish.

**** Example

#+begin_src clojure :tangle no
  (cash-flow (nth (vec unique-CNPJ) 6) vec-revenues vec-biorc)
#+end_src

*RESULTS:*
: 1555.00M

Mapping the function =cash-flow= into 10 fist values,
#+begin_src clojure :tangle no
(take 10 (map #(cash-flow % vec-revenues vec-biorc) unique-CNPJ))
#+end_src

#+RESULTS:
| 575.65M | 2637.2M | 1804.7M | 3187.85M | 2606.78M | 2823.39M | 1555.00M | -772.41M | 1931.8M | -2378.72M |

Take the first 10 CNPJ values mapped explicitly,
#+begin_src clojure :tangle no
(map  #(nth (vec unique-CNPJ) %) (range 10))
#+end_src

#+RESULTS:
| 17194123000103 | 25080236000106 | 28945518000117 | 22209468000123 | 19461682000168 | 36030066000171 | 17946892000110 | 3022033000120 | 28531013000106 | 26797909000106 |

Zip these, so in a /map/ of key-pairs.
#+begin_src clojure :tangle no 
  (zipmap
   (map keyword
        (map #(nth (vec unique-CNPJ) %)
             (range 10)))
   (take 10
         (map #(cash-flow % vec-revenues vec-biorc)
              unique-CNPJ)))
#+end_src

#+RESULTS:
| :36030066000171 | 2823.39M | :3022033000120 | -772.41M | :28531013000106 | 1931.8M | :19461682000168 | 2606.78M | :25080236000106 | 2637.2M | :17946892000110 | 1555.00M | :17194123000103 | 575.65M | :28945518000117 | 1804.7M | :26797909000106 | -2378.72M | :22209468000123 | 3187.85M |

